{
  "aldo-bender": {
    "links": [
      "https://www.discogs.com/artist/8820-Aldo-Bender"
    ],
    "bio": "Aldo Bender was a Southern California native and a pioneering figure in the early West Coast rave scene, known for his role both behind the decks and behind the scenes. He was closely associated with formative venues and nights such as Club Post Nuclear and Happy Wednesdays, where he helped shape dance programming during a crucial period in the late 1980s as rave culture was taking hold in California. In addition to DJing at underground clubs, large venues, and festivals, Aldo built a wide ranging career across music, media, and live entertainment. Operating under The SmartSystems Media Group, he worked as a freelance media analyst and troubleshooter while also serving as a television writer and producer, senior managing editor of Clublife Magazine, sports promoter and announcer, record label owner, music producer, and recording artist. Earlier in life, he spent several years as a professional ski instructor in Mammoth Lakes, where he first learned to DJ. Remembered for his versatility and influence, Aldo remains an important part of West Coast rave history."
  },
  "american-thomas": {
    "links": [
      "https://www.discogs.com/artist/54920-Thomas-Michael"
    ]
  },
  "bad-boy-bill": {
    "links": [
      "https://www.discogs.com/artist/17799-Bad-Boy-Bill"
    ]
  },
  "barry-weaver": {
    "links": [
      "https://www.discogs.com/artist/1546294-Barry-Weaver"
    ],
    "bio": "Barry Weaver began DJing in Los Angeles in the mid 1980s, building on an early musical foundation that included saxophone, choir, and theater. Immersed in San Francisco's late 1970s disco and live music culture, he was deeply influenced by DJ Bobby Viteritti and venues like the Trocadero Transfer, experiences that pushed him toward DJing. Throughout the 1980s and early 1990s, Barry moved between San Francisco and Los Angeles, taking part in disco, new wave, punk, and underground parties that helped shape the early rave and acid house movement. An early champion of house, techno, and breaks, he became part of the first generation of LA rave DJs and played extensively across North America. A devoted record collector, Barry spent more than 15 years working in influential West Coast record shops, refining his skills as a selector and tastemaker. Known for connecting classic influences with contemporary house and techno, his impact on West Coast dance music remains enduring."
  },
  "chris-flores": {
    "links": [
      "https://www.discogs.com/artist/1096345-Chris-Flores"
    ]
  },
  "chris-hyde": {
    "links": [
      "https://www.discogs.com/artist/149318-Chris-Hyde"
    ]
  },
  "daniel": {
    "links": [
      "https://www.discogs.com/artist/145959-Daniel-Chavez"
    ]
  },
  "derrick-carter": {
    "links": [
      "https://www.discogs.com/artist/3338-Derrick-Carter"
    ]
  },
  "destructo": {
    "links": [
      "https://www.discogs.com/artist/87049-Destructo"
    ]
  },
  "dj-curious": {
    "links": [
      "https://www.discogs.com/artist/292621-DJ-Curious"
    ]
  },
  "dj-dan": {
    "links": [
      "https://www.discogs.com/artist/217-DJ-Dan"
    ],
    "bio": "DJ Dan is a legendary DJ and producer whose career bridges the early rave era and today's global dance community. After discovering electronic music in the late 1980s, he moved to Los Angeles in 1991 and quickly became a defining voice within West Coast house culture. In the early 1990s he became part of the influential Funky Tekno Tribe collective in San Francisco, helping shape the underground sound on both sides of the state before establishing his own imprint, InStereo Recordings, in 2001. Known for his fusion of house, tech house, and techno, Dan built a reputation through relentless touring, iconic mixtapes, and tracks that became staples in club rotation. His work earned industry acclaim, including recognition as a top house DJ, and he has performed at major international festivals and venues around the world. Across decades of evolution in electronic music, his dynamic sets and consistent output have made him one of the scene's most respected and enduring figures."
  },
  "dj-e-zone": {
    "aliases": [
      {
        "name": "Eric Davenport",
        "slug": "eric-davenport"
      }
    ],
    "links": [
      "https://www.discogs.com/artist/2439351-DJ-E-Zone"
    ]
  },
  "dj-goldie": {
    "links": [
      "https://www.discogs.com/artist/2825-Goldie"
    ]
  },
  "dj-heretic": {
    "links": [
      "https://www.discogs.com/artist/13670-Heretic"
    ]
  },
  "dj-jesse": {
    "links": [
      "https://www.discogs.com/artist/292198-Jesse-Brooks"
    ]
  },
  "dj-josh-swissman": {
    "links": [
      "https://www.discogs.com/artist/1269959-Josh-Swissman"
    ]
  },
  "dj-juanito": {
    "links": [
      "https://www.discogs.com/artist/71042-DJ-Juanito"
    ]
  },
  "dj-mark-farina": {
    "links": [
      "https://www.discogs.com/artist/4710-Mark-Farina"
    ]
  },
  "dj-mellinfunk": {
    "links": [
      "https://www.discogs.com/artist/197007-DJ-Mellinfunk"
    ]
  },
  "dj-mojo": {
    "links": [
      "https://www.discogs.com/artist/2592013-Mojo-Rising?anv=Mojo"
    ],
    "bio": "DJ Mojo is a versatile DJ and storyteller whose roots trace back to the heart of Los Angeles' early underground rave scene. He began playing in 1992 at the influential weekly afterhours What?, emerging during the city's golden rave era before becoming a resident for both F.A.M.I.L.Y and Insomniac. Throughout the 1990s, Mojo was a regular presence across Southern California, performing at landmark events including the first three Nocturnal Wonderland events and Organic '96. He is known for eclectic sets that move fluidly across techno, house, drum and bass, and trip hop, with an affinity for breakbeats and funk driven, bass heavy sounds. A dedicated vinyl collector, he is deeply committed to preserving and sharing the history of underground dance culture. Under the alias Mojo Rising, he has released a steady body of production work, including downtempo and trip hop releases for the Los Angeles label Cold Busted, while continuing to maintain a respected presence behind the decks."
  },
  "dj-n2o": {
    "links": [
      "https://www.discogs.com/artist/4289904-DJ-N2O"
    ]
  },
  "dj-robin": {
    "links": [
      "https://www.discogs.com/artist/696645-DJ-Robin-2"
    ]
  },
  "dj-spinn": {
    "links": [
      "https://www.discogs.com/artist/1793022-DJ-Spinn"
    ]
  },
  "dj-thee-o": {
    "links": [
      "https://www.discogs.com/artist/126595-Thee-O"
    ],
    "bio": "Thee-O began spinning records at a young age and by 1992 had become a fixture in Southern California's underground rave scene, earning a reputation for technical skill and deep commitment to the culture. His musical tastes span a wide range of electronic styles, and over the years he has played across house, techno, trance, ambient, and drum and bass, exploring different sounds in different contexts rather than limiting himself to a single lane. Long regarded as a constant presence in Los Angeles nightlife, he has remained deeply embedded in the city's dance culture while continuing to evolve as a DJ and producer. His work as a producer and remixer has appeared on respected labels, and his involvement in events and creative projects has helped connect different corners of the West Coast scene, reinforcing his role as one of LA's enduring underground figures."
  },
  "dj-trance": {
    "aliases": [
      {
        "name": "Jason Blakemore",
        "slug": "jason-blakemore"
      }
    ],
    "links": [
      "https://www.discogs.com/artist/28017-DJ-Trance"
    ],
    "bio": "DJ Trance was the early 1990s alias of Jason Blakemore, under which he became one of the most recognizable DJs in the Los Angeles rave scene. Known for high energy sets, quick mixing, and a narrative approach to programming, DJ Trance played a key role in defining the sound and atmosphere of Southern California raves during that era. The alias represents a specific chapter of Blakemore's career, rooted in the formative years of West Coast rave culture."
  },
  "dj-vitamin-d": {
    "links": [
      "https://www.discogs.com/artist/29336-DJ-Vitamin-D"
    ]
  },
  "doc-martin": {
    "links": [
      "https://www.discogs.com/artist/3878-Doc-Martin"
    ],
    "bio": "Doc Martin is a defining figure in American electronic music, emerging from San Francisco's 1980s dance underground with a sound shaped by deep record knowledge and a wide musical range. Raised in a musical family, he gravitated toward electronic culture early, absorbing acid house, techno, and related styles through record stores and early club scenes. In the early 1990s, he relocated to Los Angeles, where he became a central presence in the city's rave movement before expanding onto the international stage. Known for long, fluid sets that prioritize atmosphere and narrative over trends, his career has taken him from intimate underground spaces to influential clubs and festivals across Europe, Asia, and the Americas. Decades into his journey, Doc Martin continues to perform and release music, evolving his sound while remaining deeply rooted in the culture that shaped him, earning enduring respect across generations of dance music fans."
  },
  "dom-t": {
    "links": [
      "https://www.discogs.com/artist/65176-Dom-T"
    ]
  },
  "drc": {
    "links": [
      "https://www.discogs.com/artist/56653-DRC"
    ]
  },
  "dubtribe": {
    "links": [
      "https://www.discogs.com/artist/705-Dubtribe-Sound-System"
    ]
  },
  "eli-star": {
    "links": [
      "https://www.discogs.com/artist/49068-Eli-Star"
    ]
  },
  "eric-davenport": {
    "aliases": [
      {
        "name": "DJ E-Zone",
        "slug": "dj-e-zone"
      }
    ],
    "links": [
      "https://www.discogs.com/artist/60678-Eric-Davenport"
    ]
  },
  "erik-ludloff": {
    "links": [
      "https://www.discogs.com/artist/2372917-Erik-Ludloff"
    ]
  },
  "ernie-munson": {
    "links": [
      "https://www.discogs.com/artist/1666150-Ernie-Munson"
    ]
  },
  "fester": {
    "links": [
      "https://www.discogs.com/artist/197005-Fester"
    ],
    "bio": "Fester began his journey into DJ culture in the early 1980s, teaching himself the basics on a boombox when turntables and a mixer were out of reach. That DIY start led him deep into B-boy culture, from breakbeats and battling to graffiti and turntablism, while he learned by observing neighborhood DJ crews. As his taste evolved, he explored new wave, disco, funk, and anything that resonated on the dance floor, paying his dues as a mobile DJ at weddings and house parties. In the early 1990s, he discovered techno and underground culture through Eric Davenport, aka E Zone, launching a new phase that included touring, large crowds, live PA performances with Axis Worklabs, and a short stint with the independent label Turnstyle Records."
  },
  "jason-bentley": {
    "links": [
      "https://www.discogs.com/artist/59028-Jason-Bentley"
    ]
  },
  "jason-blakemore": {
    "aliases": [
      {
        "name": "DJ Trance",
        "slug": "dj-trance"
      }
    ],
    "links": [
      "https://www.discogs.com/artist/25954-Jason-Blakemore"
    ],
    "bio": "Jason Blakemore is one of the original Los Angeles underground techno DJs. He played extensively throughout Southern California during the rise of rave culture, appearing at major festivals including Coachella, EDC, Jujubeats, and Nocturnal Wonderland, as well as cities across the U.S., Canada, and Mexico. Alongside DJing, he ran record labels including Bassex, Life Music, and Fiveleg."
  },
  "jeno": {
    "links": [
      "https://www.discogs.com/artist/4906-Jeno"
    ]
  },
  "jon-bishop": {
    "links": [
      "https://www.discogs.com/artist/38228-Jon-Bishop"
    ]
  },
  "jon-williams": {
    "links": [
      "https://www.discogs.com/artist/16476-Jon-Williams"
    ]
  },
  "jonny-5": {
    "links": [
      "https://www.discogs.com/artist/3883597-Jonny-5-3"
    ]
  },
  "josh": {
    "links": [
      "https://www.discogs.com/artist/819735-DJ-Josh-5"
    ]
  },
  "josh-mcclintock": {
    "links": [
      "https://soundcloud.com/josh-from-ny"
    ],
    "bio": "Josh McClintock is an underground dance music DJ whose roots trace back to Los Angeles in the early 1990s. He emerged through formative nights like Unlock the House, where he opened for Doc Martin, and gained wider recognition through his Acid Junky mixtape series. After relocating to New York City, McClintock spent more than a decade immersed in the city's record store culture, digging at influential shops such as Sonic Groove, Dance Trax, and Satellite Records, experiences that deeply shaped his sound and approach. Returning to California in 2010, he entered a renewed creative period marked by standout appearances at Sublevel, Jack, Mount Analog's Nuit Noire, Sunny Side Up at the 5 Star Bar, and the legendary MFD warehouse parties. Now based in Colorado, McClintock remains committed to a vinyl only ethos, carrying forward a style grounded in deep record knowledge and underground tradition."
  },
  "jughead": {
    "links": [
      "https://www.discogs.com/artist/2942790-Jughead-9"
    ]
  },
  "kandyman": {
    "links": [
      "https://www.discogs.com/artist/10756612-The-Kandyman"
    ]
  },
  "keoki": {
    "links": [
      "https://www.discogs.com/artist/2872-Keoki"
    ]
  },
  "lenny-v": {
    "links": [
      "https://www.discogs.com/artist/120278-Lenny-V"
    ]
  },
  "louis-love": {
    "links": [
      "https://www.discogs.com/artist/89607-Louis-Love"
    ]
  },
  "marc-anthony": {
    "links": [
      "https://www.discogs.com/artist/13010046-Marc-Anthony-17"
    ]
  },
  "mark-lewis": {
    "links": [
      "https://www.discogs.com/artist/14419-Mark-Lewis"
    ]
  },
  "markem-x": {
    "links": [
      "https://www.discogs.com/artist/1984163-Markem-X"
    ]
  },
  "markie-mark": {
    "links": [
      "https://www.discogs.com/artist/51186-Markie-Mark"
    ]
  },
  "marques-wyatt": {
    "links": [
      "https://www.discogs.com/artist/15781-Marques-Wyatt"
    ]
  },
  "moonpup": {
    "links": [
      "https://www.discogs.com/artist/881504-Moonpup"
    ]
  },
  "mr-buzz": {
    "links": [
      "https://www.discogs.com/artist/9672493-Mr-Buzz"
    ],
    "bio": "Mr. Buzz was a recognizable presence in the Los Angeles underground rave scene during the early 1990s. Best known for his Acid Hits mixtape series, he helped circulate early acid house, techno, and hardcore at parties between roughly 1990 and 1993, when tapes were passed hand to hand. Coming out of the late 1980s High Energy scene, Buzz was deeply connected within the local rave community and was often seen near the DJ booth, distributing tapes and connecting people. His mixtapes stood out for their hands on, tape deck editing style, where he reworked tracks into new compositions using cuts, rearrangements, and effects. Many tapes featured his own recorded voiceovers, shout outs, and humor layered directly into the mixes, along with a voicemail number that listeners could call. Instantly recognizable by his police style hat labeled Acid Hits, whistle, and constant smile, his early tapes remain cult artifacts of the era."
  },
  "mr-kool-aid": {
    "links": [
      "https://www.discogs.com/artist/48013-Mr-Koolaid"
    ]
  },
  "oscar-da-grouch": {
    "links": [
      "https://www.discogs.com/artist/53407-Oscar-Da-Grouch"
    ]
  },
  "raw": {
    "links": [
      "https://www.discogs.com/artist/74120-RAW-2"
    ],
    "bio": "Emerging from the streets of Los Angeles, R.A.W. has been a central force in the city's jungle scene since 1992, when he launched the short-lived but legendary weekly JUNGLE, a foundational gathering for West Coast junglists. In the early 90s, he also served as the jungle buyer for top DJ shops like Street Sounds and Beat Non Stop, gaining early access to rare UK white labels and establishing himself as a key ambassador for the sound. Known for his turntablist skills, R.A.W. made history in 1998 as the first DJ to win a battle using drum and bass records. Between 1997 and 2004, he released more than 50 jungle, dnb, and hardcore tracks under multiple aliases and labels, while his mixtapes became cult staples. After a successful chapter as dubstep artist 6Blocc, he returned to his roots as SKANX, continuing to shape jungle's future while honoring its origins."
  },
  "raymond-roker": {
    "links": [
      "https://www.discogs.com/artist/1999932-Raymond-Roker"
    ]
  },
  "resistance-d": {
    "links": [
      "https://www.discogs.com/artist/1295-Resistance-D"
    ]
  },
  "robbie-hardkiss": {
    "links": [
      "https://www.discogs.com/artist/16479-Robbie-Hardkiss"
    ]
  },
  "ron-d-core": {
    "links": [
      "https://www.discogs.com/artist/38792-Ron-D-Core"
    ]
  },
  "scott-hardkiss": {
    "links": [
      "https://www.discogs.com/artist/9827-Scott-Hardkiss"
    ]
  },
  "shaheen": {
    "links": [
      "https://www.discogs.com/artist/16187-Shaheen"
    ]
  },
  "simon": {
    "links": [
      "https://www.discogs.com/artist/3876-Simon"
    ]
  },
  "simply-jeff": {
    "links": [
      "https://www.discogs.com/artist/16469-Simply-Jeff"
    ]
  },
  "skylab-2000": {
    "links": [
      "https://www.discogs.com/artist/18720-Skylab-2000"
    ]
  },
  "spice-lab": {
    "links": [
      "https://www.discogs.com/artist/1304-Spicelab"
    ]
  },
  "spun": {
    "links": [
      "https://www.discogs.com/artist/8308-DJ-Spun"
    ]
  },
  "steve-leclair": {
    "links": [
      "https://www.discogs.com/artist/1973917-Steve-LeClair"
    ]
  },
  "steve-loria": {
    "links": [
      "https://www.discogs.com/artist/29474-Steve-Loria"
    ],
    "bio": "Steve Loria is a West Coast house DJ widely regarded as one of the key forces behind the rise of the Los Angeles underground. He began DJing at a young age and came up on hip hop before discovering acid house in 1987, a turning point that pulled him fully into dance music. After immersing himself in record store culture and obsessively building his collection, he started earning local attention and quickly became a defining presence at Southern California raves and foundational weeklies, including Citrusonic and More. From those early rooms, Loria helped shape the sound and identity of West Coast house, later taking his sets worldwide and headlining landmark events such as Together As One, By the People, Freedom Festival, and Electric Daisy Carnival. Known for long, high control sets and a wide range that moves through deep, progressive, and acid leaning house, he continues to represent the connective thread between LA's early rave era and the scenes that followed."
  },
  "tony-b": {
    "links": [
      "https://www.discogs.com/artist/9688-Tony-B!"
    ]
  },
  "tony-largo": {
    "links": [
      "https://www.discogs.com/artist/328619-Tony-Largo"
    ]
  },
  "wade-randolph-hampton": {
    "links": [
      "https://www.discogs.com/artist/96404-Wade-Randolph-Hampton"
    ]
  },
  "xavier": {
    "links": [
      "https://www.discogs.com/artist/4109274-Xavier-De-Enciso"
    ]
  }
}
